Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: calculating a first ratio as the first amount of power requested divided by a total amount of power requested;
de_de: Berechnen eines ersten Verhältnisses als die erste Menge angeforderter Leistung geteilt durch eine Gesamtmenge angeforderter Leistung;

source: calculating a second ratio as the second amount of power requested divided by the total amount of power requested;
de_de: Berechnen eines zweiten Verhältnisses als die zweite Menge angeforderter Leistung geteilt durch die Gesamtmenge angeforderter Leistung;

source: calculating a first duration of a first time period based on the first ratio multiplied by a preconfigured amount of time;
de_de: Berechnen einer ersten Dauer eines ersten Zeitraums auf der Grundlage des ersten Verhältnisses multipliziert mit einer vorkonfigurierten Zeitspanne;

source: calculating a second duration of a second time period based on the second ratio multiplied by the preconfigured amount of time;
de_de: Berechnen einer zweiten Dauer eines zweiten Zeitraums auf der Grundlage des zweiten Verhältnisses multipliziert mit der vorkonfigurierten Zeitspanne;

source: controlling the first triac to deliver, for the first duration of the first time period, a first phase-controlled AC wave pattern represented by the first power array to the first heating element;
de_de: Steuern des ersten Triacs, um für die erste Dauer der ersten Zeitperiode ein erstes phasengesteuerte Wechselstromwellenmuster, das durch das erste Leistungsarray dargestellt wird, an das erste Heizelement zu liefern;

source: controlling the second triac to deliver, for the first duration of the first time period, a second phase-controlled AC wave pattern represented by the second power array to the second heating element;
de_de: Steuern des zweiten Triacs, um für die erste Dauer der ersten Zeitperiode ein zweites phasengesteuertes Wechselstromwellenmuster, das durch das zweite Leistungsarray dargestellt wird, an das zweite Heizelement zu liefern;

source: controlling the first triac to deliver, for the second duration of the second time period, the second phase-controlled AC wave pattern represented by the second power array to the first heating element; and
de_de: Steuern des ersten Triacs, um für die zweite Dauer der zweiten Zeitperiode das zweite phasengesteuerte Wechselstromwellenmuster, das durch das zweite Leistungsarray dargestellt wird, an das erste Heizelement zu liefern; und

source: controlling the second triac to deliver, for the second duration of the second time period, the first phase-controlled AC wave pattern represented by the first power array to the second heating element.
de_de: Steuern des zweiten Triacs, um für die zweite Dauer der zweiten Zeitperiode das erste phasengesteuerte Wechselstromwellenmuster, das durch das erste Leistungsarray dargestellt wird, an das zweite Heizelement zu liefern.

source: 9. The method of claim 8, wherein the total power requested is a combination of the first amount of power requested and the second amount of power requested.
de_de: 9. Verfahren nach Anspruch 8, wobei die angeforderte Gesamtleistung eine Kombination aus der ersten angeforderten Leistungsmenge und der zweiten angeforderten Leistungsmenge ist.

source: The method of claim 8, wherein each numeric value of the first power array is between 0 ≤ x ≤ 1.0.
de_de: Verfahren nach Anspruch 8, wobei jeder numerische Wert des ersten Leistungsarrays zwischen 0 ≤ x ≤ 1,0 ist.

source: The method of claim 8, further including calculating a first phase angle array by applying the equation arccos (2x-1) to each numeric value of the first power array.
de_de: Verfahren nach Anspruch 8, das ferner das Berechnen eines ersten Phasenwinkelarrays durch Anwenden der Gleichung arccos (2x-1) auf jeden numerischen Wert des ersten Leistungsarrays umfasst.

source: The method of claim 11, wherein each numeric value of the first phase angle array represents a phase-angle cut of one phase-controlled AC wave.
de_de: Verfahren nach Anspruch 11, wobei jeder numerische Wert des ersten Phasenwinkelarrays einen Phasenwinkelschnitt einer phasengesteuerten Wechselstromwelle darstellt.

source: The method of claim 12, wherein each alternate value of the first power array is "0" and represents an "off" wave, such that the first phase-controlled AC wave pattern includes a phase-controlled AC wave followed by an "off" wave.
de_de: Verfahren nach Anspruch 12, wobei jeder alternative Wert des ersten Leistungsarrays "0" ist und eine "Aus"-Welle darstellt, sodass das erste phasengesteuerte Wechselstromwellenmuster eine phasengesteuerte Wechselstromwelle gefolgt von einer "Aus"-Welle beinhaltet.

source: The method of claim 13, wherein each alternate value of the first power array is "1.0" and represents a full "on" wave, such that the first phase-controlled AC wave pattern includes a phase-controlled AC wave followed by an "on" wave.
de_de: Verfahren nach Anspruch 13, wobei jeder alternative Wert des ersten Leistungsarrays "1,0" ist und eine vollständige "Ein"-Welle darstellt, sodass das erste phasengesteuerte Wechselstromwellenmuster eine phasengesteuerte Wechselstromwelle gefolgt von einer "Ein"-Welle beinhaltet.

source: Claims
de_de: Patentansprüche

source: 1. A display assembly (10) with integrated electric vehicle charging equipment (150), said display assembly comprising:
de_de: 1. Anzeigebaugruppe (10) mit integrierter Elektrofahrzeug-Ladeeinrichtung (150), wobei die Anzeigebaugruppe Folgendes umfasst:

source: a structural frame (114);
de_de: einen Strukturrahmen (114);

source: a first side assembly (111) connected to a first side of said structural frame, said first side assembly comprising a first cover (112) and a first electronic display subassembly (144) located behind said first cover;
de_de: eine erste Seitenbaugruppe (111), die mit einer ersten Seite des Strukturrahmens verbunden ist, wobei die erste Seitenbaugruppe eine erste Abdeckung (112) und eine erste elektronische Anzeigeunterbaugruppe (144) umfasst, die sich hinter der ersten Abdeckung befindet;

source: a second side assembly (111) connected to a second side of said structural frame, said second side assembly comprising a second cover (112) and a second electronic display subassembly (144) located behind said second cover;
de_de: eine zweite Seitenbaugruppe (111), die mit einer zweiten Seite des Strukturrahmens verbunden ist, wobei die zweite Seitenbaugruppe eine zweite Abdeckung (112) und eine zweite elektronische Anzeigeunterbaugruppe (144) umfasst, die sich hinter der zweiten Abdeckung befindet;

source: characterized in that a common cavity (118) is located between the first side assembly and the second side assembly;
de_de: dadurch gekennzeichnet, dass sich zwischen der ersten Seitenbaugruppe und der zweiten Seitenbaugruppe ein gemeinsamer Hohlraum (118) befindet;

source: a housing (151) extending inward from the structural frame into the common cavity to at least partially recess said housing; and
de_de: ein Gehäuse (151), das von dem Strukturrahmen nach innen in den gemeinsamen Hohlraum verläuft, um das Gehäuse mindestens teilweise zu vertiefen; und

source: said electric vehicle charging equipment (150), wherein said electric vehicle charging equipment is connected to said structural frame between said first side assembly and said second side assembly, and wherein external components of said electric vehicle charging equipment are located at said housing for storage in a recessed manner.
de_de: die Elektrofahrzeug-Ladeeinrichtung (150), wobei die Elektrofahrzeug-Ladeeinrichtung mit dem Strukturrahmen zwischen der ersten Seitenbaugruppe und der zweiten Seitenbaugruppe verbunden ist, und wobei sich externe Komponenten der Elektrofahrzeug-Ladeeinrichtung in einer vertieften Weise zum Lagern an dem Gehäuse befinden.

source: 2. The display assembly of claim 1 wherein:
de_de: 2. Anzeigebaugruppe nach Anspruch 1, wobei:

source: said electric vehicle charging equipment is fully recessed between said first side assembly and said second side assembly when an electric vehicle connector portion for said electric vehicle charging equipment is docked at the display assembly.
de_de: die Elektrofahrzeug-Ladeeinrichtung vollständig zwischen der ersten Seitenbaugruppe und der zweiten Seitenbaugruppe vertieft ist, wenn ein Elektrofahrzeug-Verbindungsabschnitt für die Elektrofahrzeug-Ladeeinrichtung an der Anzeigebaugruppe angedockt ist.

source: 3. The display assembly of claim 1 further comprising:
de_de: 3. Anzeigebaugruppe nach Anspruch 1, ferner umfassend:

source: a closed loop airflow pathway for circulating gas comprising a first portion extending within said first side assembly, a second portion extending within said second side assembly, and said common cavity.
de_de: einen Luftströmungsweg mit geschlossenem Kreislauf zum Zirkulieren von Gas, der einen ersten Abschnitt, der innerhalb der ersten Seitenbaugruppe verläuft, einen zweiten Abschnitt, der innerhalb der zweiten Seitenbaugruppe verläuft, und den gemeinsamen Hohlraum umfasst.

source: 4. The display assembly of claim 3 further comprising:
de_de: 4. Anzeigebaugruppe nach Anspruch 3, ferner umfassend:

source: at least one loop airflow pathway for ambient air.
de_de: mindestens einen Kreislauf-Luftströmungsweg für Umgebungsluft.

source: 5. The display assembly of claim 4 wherein:
de_de: 5. Anzeigebaugruppe nach Anspruch 4, wobei:

source: said at least one open loop airflow pathway comprises a first open loop airflow pathway extending through said first side assembly and a second open loop airflow pathway extending through said second side assembly.
de_de: der mindestens eine Luftströmungsweg mit offenem Kreislauf einen ersten Luftströmungsweg mit offenem Kreislauf umfasst, der durch die erste Seitenbaugruppe verläuft, und einen zweiten Luftströmungsweg mit offenem Kreislauf, der durch die zweite Seitenbaugruppe verläuft.

source: 6. The display assembly of claim 5 further comprising:
de_de: 6. Anzeigebaugruppe nach Anspruch 5, ferner umfassend:

source: a common intake for said first open loop airflow pathway and said second open loop airflow pathway located at an upper portion of said first and second side assemblies;
de_de: einen gemeinsamen Einlass für den ersten Luftströmungsweg mit offenem Kreislauf und den zweiten Luftströmungsweg mit offenem Kreislauf, der sich an einem oberen Abschnitt der ersten und zweiten Seitenbaugruppe befindet;

source: a first exhaust for said first open loop airflow pathway;
de_de: einen ersten Auslass für den ersten Luftströmungsweg mit offenem Kreislauf;

source: a second exhaust for said second open loop airflow pathway; and
de_de: einen zweiten Auslass für den zweiten Luftströmungsweg mit offenem Kreislauf; und

source: a common set of open loop fans located adjacent to said common intake, wherein said common set of open loop fans comprise centrifugal type fans oriented to distribute ingested ambient air into both of said first open loop airflow pathway and said second open loop airflow pathway when operated.
de_de: einen gemeinsamen Satz von Gebläsen mit offenem Kreislauf, die sich zu dem gemeinsamen Einlass benachbart befinden, wobei der gemeinsame Satz von Gebläsen mit offenem Kreislauf Zentrifugaltyp-Gebläse umfasst, die ausgerichtet sind, um angesaugte Umgebungsluft im Betrieb sowohl in den ersten Luftströmungsweg mit offenem Kreislauf als auch in den zweiten Luftströmungsweg mit offenem Kreislauf zu verteilen.

source: 7. The display assembly of claim 6 wherein:
de_de: 7. Anzeigebaugruppe nach Anspruch 6, wobei:

source: each of said centrifugal type fans of said common set of open loop fans are provided without a shroud.
de_de: jedes der Zentrifugaltyp-Gebläse des gemeinsamen Satzes von Gebläsen mit offenem Kreislauf ohne Abdeckhaube bereitgestellt ist.

source: 8. The display assembly of claim 6 further comprising:
de_de: 8. Anzeigebaugruppe nach Anspruch 6, ferner umfassend:

source: a set of one or more closed loop fans located within said common cavity for moving circulating gas through said closed loop airflow pathway when operated.
de_de: einen Satz von einem oder mehreren Gebläsen mit geschlossenem Kreislauf, die sich in dem gemeinsamen Hohlraum befinden, um im Betrieb zirkulierendes Gas durch den Luftströmungsweg mit geschlossenem Kreislauf zu bewegen.

source: 9. The display assembly of claim 8 further comprising:
de_de: 9. Anzeigebaugruppe nach Anspruch 8, ferner umfassend:

source: a side panel located within said common cavity and oriented perpendicular to a front surface of said first side assembly and a front surface of said second side assembly, wherein each fan in said set of one or more closed loop fans comprises a centrifugal type fan spaced apart vertically along said side panel.
de_de: eine Seitenwand, die sich in dem gemeinsamen Hohlraum befindet und senkrecht zu einer vorderen Fläche der ersten Seitenbaugruppe und einer vorderen Fläche der zweiten Seitenbaugruppe ausgerichtet ist, wobei jedes Gebläse in dem Satz von einem oder mehreren Gebläsen mit geschlossenem Kreislauf ein Zentrifugaltyp-Gebläse umfasst, das vertikal entlang der Seitenwand beabstandet ist.

source: The display assembly of claim 5 wherein:
de_de: Anzeigebaugruppe nach Anspruch 5, wobei:

source: said first electronic display subassembly comprises a first LCD display layer and a first backlight;
de_de: die erste elektronische Anzeigeunterbaugruppe eine erste LCD-Anzeigeschicht und eine erste Hintergrundbeleuchtung umfasst;

source: said second electronic display subassembly comprises a second LCD display layer and a second backlight;
de_de: die zweite elektronische Anzeigeunterbaugruppe eine zweite LCD-Anzeigeschicht und eine zweite Hintergrundbeleuchtung umfasst;

source: said first open loop airflow pathway extends directly adjacent to the first backlight; and
de_de: der erste Luftströmungsweg mit offenem Kreislauf direkt benachbart zu der ersten Hintergrundbeleuchtung verläuft; und

source: said second open loop airflow pathway extends directly adjacent to the second backlight.
de_de: der zweite Luftströmungsweg mit offenem Kreislauf direkt benachbart zu der zweiten Hintergrundbeleuchtung verläuft.

source: The display assembly of claim 10 wherein:
de_de: Anzeigebaugruppe nach Anspruch 10, wobei:

source: said first portion of said closed loop airflow pathway is located between said first cover and said first LCD display layer of said first electronic display subassembly; and
de_de: sich der erste Abschnitt des Luftströmungswegs mit geschlossenem Kreislauf zwischen der ersten Abdeckung und der ersten LCD-Anzeigeschicht der ersten elektronischen Anzeigeunterbaugruppe befindet; und

source: said second portion of said closed loop airflow pathway is located between said second cover and said second LCD display layer of said second electronic display subassembly.
de_de: sich der zweite Abschnitt des Luftströmungswegs mit geschlossenem Kreislauf zwischen der zweiten Abdeckung und der zweiten LCD-Anzeigeschicht der zweiten elektronischen Anzeigeunterbaugruppe befindet.

source: The display assembly of claim 1 further comprising:
de_de: Anzeigebaugruppe nach Anspruch 1, ferner umfassend:

source: an additional equipment cavity located below, and at least partially between, said first side assembly and said second side assembly; and
de_de: einen zusätzlichen Einrichtungshohlraum, der sich unter und mindestens teilweise zwischen der ersten Seitenbaugruppe und der zweiten Seitenbaugruppe befindet; und

source: one or more internal components of said electric vehicle charging equipment located within said additional equipment cavity.
de_de: eine oder mehrere interne Komponenten der Elektrofahrzeug-Ladeeinrichtung, die sich in dem zusätzlichen Einrichtungshohlraum befinden.

source: The display assembly of claim 12 further comprising:
de_de: Anzeigebaugruppe nach Anspruch 12, ferner umfassend:

source: a dedicated open loop airflow pathway through said additional equipment cavity.
de_de: ein spezieller Luftströmungsweg mit offenem Kreislauf durch den zusätzlichen Einrichtungshohlraum.

source: a first gasket provided at said structural frame between said structural frame and said first side assembly, wherein said first side assembly is moveably connected to said structural frame between a closed position where said first gasket is compressed between said first side assembly and said structural frame and an open position where an edge of said first side assembly is rotated away from said structural frame; and
de_de: eine erste Dichtung, die an dem Strukturrahmen zwischen dem Strukturrahmen und der ersten Seitenbaugruppe bereitgestellt ist, wobei die erste Seitenbaugruppe beweglich mit dem Strukturrahmen zwischen einer geschlossenen Position, in der die erste Dichtung zwischen der ersten Seitenbaugruppe und dem Strukturrahmen zusammengedrückt ist, und einer offenen Position, in der eine Kante der ersten Seitenbaugruppe von dem Strukturrahmen weggedreht ist, verbunden ist; und

source: a second gasket provided at said structural frame between said structural frame and said second side assembly, wherein said second side assembly is moveably connected to said structural frame between a closed position where said second gasket is compressed between said second side assembly and said structural frame and an open position where an edge of said second side assembly is rotated away from said structural frame.
de_de: eine zweite Dichtung, die an dem Strukturrahmen zwischen dem Strukturrahmen und der zweiten Seitenbaugruppe bereitgestellt ist, wobei die zweite Seitenbaugruppe beweglich mit dem Strukturrahmen zwischen einer geschlossenen Position, in der die zweite Dichtung zwischen der zweiten Seitenbaugruppe und dem Strukturrahmen zusammengedrückt ist, und einer offenen Position, in der eine Kante der zweiten Seitenbaugruppe von dem Strukturrahmen weggedreht ist, verbunden ist.

source: a common power source for said first side assembly, said second side assembly, and said electric vehicle charging equipment.
de_de: eine gemeinsame Stromquelle für die erste Seitenbaugruppe, die zweite Seitenbaugruppe und die Elektrofahrzeug-Ladeeinrichtung.

source: 1. A metrology system comprising:
de_de: 1. Metrologiesystem, umfassend:

source: an x-ray illumination source (110) configured to generate an amount of soft x-ray radiation;
de_de: eine Röntgenbeleuchtungsquelle (110), die konfiguriert ist, eine Menge von weicher Röntgenstrahlung zu erzeugen;

source: an illumination optics subsystem (111) disposed in an illumination optical path between the x-ray illumination source (110) and a specimen (101) under measurement, the illumination optics subsystem including one or more x-ray illumination optical elements configured to direct the amount of soft x-ray radiation from the x-ray illumination source (110) to an illumination spot (102) on the specimen under measurement, wherein a length of the illumination optical path from the x-ray illumination source to the specimen under measurement is less than 2 meters, and wherein the one or more x-ray illumination optical elements focus the amount of soft x-ray radiation onto the illumination spot with a demagnification factor of at least 1.25, the illumination optics subsystem including an internal field stop (254, 264) disposed in the illumination optical path, the internal field stop conjugate to the illumination source and the specimen under measurement;
de_de: ein Beleuchtungsoptikteilsystem (111), das in einem optischen Beleuchtungspfad zwischen der Röntgenbeleuchtungsquelle (110) und einer zu messenden Probe (101) angeordnet ist, wobei das Beleuchtungsoptikteilsystem ein oder mehrere optische Röntgenbeleuchtungselemente beinhaltet, die konfiguriert sind, die Menge von weicher Röntgenstrahlung von der Röntgenbeleuchtungsquelle (110) auf einen Beleuchtungsfleck (102) auf der zu messenden Probe zu richten, wobei eine Länge des optischen Beleuchtungspfads von der Röntgenbeleuchtungsquelle bis zu der zu messenden Probe weniger als 2 Meter ist und wobei das eine oder die mehreren optischen Röntgenbeleuchtungselemente die Menge von weicher Röntgenstrahlung mit einem Verkleinerungsfaktor von mindestens 1,25 auf den Beleuchtungsfleck fokussieren, wobei das Beleuchtungsoptikteilsystem eine in dem optischen Beleuchtungspfad angeordnete interne Feldblende (254, 264) beinhaltet, wobei die interne Feldblende zu der Beleuchtungsquelle und zu der zu messenden Probe konjugiert ist;

source: an x-ray detector (119) configured to detect an amount of x-ray radiation (118) scattered from the specimen under measurement in response to the incident x-ray radiation; and
de_de: einen Röntgendetektor (119), der konfiguriert ist, eine Menge von Röntgenstrahlung (118) zu detektieren, die als Reaktion auf die einfallende Röntgenstrahlung von der zu messenden Probe gestreut ist; und

source: a computing system (130) configured to determine a value of a parameter of interest characterizing a structure disposed on the specimen based on the detected amount of x-ray radiation.
de_de: ein Rechensystem (130), das konfiguriert ist, basierend auf der detektierten Menge von Röntgenstrahlung einen Wert eines interessierenden Parameters, der eine auf der Probe angeordnete Struktur kennzeichnet, zu bestimmen.

source: 2. The metrology system of Claim 1, wherein the x-ray illumination source (110) is a Laser Sustained Plasma (LSP) illumination source configured to generate x-ray radiation having wavelengths spanning a range from soft x-ray to infrared; or
de_de: 2. Metrologiesystem nach Anspruch 1, wobei die Röntgenbeleuchtungsquelle (110) eine laserinduzierte Plasma(LSP)-Beleuchtungsquelle ist, die konfiguriert ist, Röntgenstrahlung zu erzeugen, die einen Bereich von weicher Röntgenstrahlung bis Infrarot umspannende Wellenlängen aufweist; oder

source: wherein the x-ray illumination source (110) is a Laser Sustained Plasma (LSP) illumination source configured to generate x-ray radiation having wavelengths spanning a range from soft x-ray to infrared; and
de_de: wobei die Röntgenbeleuchtungsquelle (110) eine laserinduzierte Plasma(LSP)-Beleuchtungsquelle ist, die konfiguriert ist, Röntgenstrahlung zu erzeugen, die einen Bereich von weicher Röntgenstrahlung bis Infrarot umspannende Wellenlängen aufweist; und

source: wherein a target material of the LSP illumination source includes carbon dioxide in a solid state, xenon in a solid state, or a combination of two or more gases.
de_de: wobei ein Targetmaterial der LSP-Beleuchtungsquelle Kohlendioxid in einem festen Zustand, Xenon in einem festen Zustand oder eine Kombination aus zwei oder mehr Gasen beinhaltet.

source: 3. The metrology system of Claim 1,
de_de: 3. Metrologiesystem nach Anspruch 1,

source: wherein the soft x-ray radiation includes multiple illumination wavelengths within a photon energy range from 80 electronvolts to 3,000 electronvolts; or
de_de: wobei die weiche Röntgenstrahlung viele Beleuchtungswellenlängen innerhalb eines Photonenenergiebereichs von 80 Elektronenvolt bis 3.000 Elektronenvolt beinhaltet; oder

source: wherein the soft x-ray radiation is incident at the illumination spot on the specimen at a nominal grazing incidence angle between 0 and 30 degrees.
de_de: wobei die weiche Röntgenstrahlung an dem Beleuchtungsfleck unter einem nominalen streifenden Einfallswinkel zwischen 0 und 30 Grad auf die Probe einfällt.
